In [3]:
# Add Matplotlib inline magic command
%matplotlib inline
# Dependencies and Setup
import matplotlib.pyplot as plt
import pandas as pd

In [4]:
# Files to load
city_data_to_load = "city_data.csv"
ride_data_to_load = "ride_data.csv"

In [5]:
city_data_df = pd.read_csv('city_data.csv')
ride_data_df = pd.read_csv('ride_data.csv')

In [6]:
city_data_df.head(2)

           city  driver_count   type
0   Richardfort            38  Urban
1  Williamsstad            59  Urban

In [7]:
ride_data_df.head(2)

                 city                 date   fare        ride_id
0  Lake Jonathanshire  2019-01-14 10:14:22  13.83  5739410935873
1  South Michelleport  2019-03-04 18:24:09  30.24  2343912425577

In [8]:
city_data_df.count()

city            120
driver_count    120
type            120
dtype: int64

In [9]:
ride_data_df.count()

city       2375
date       2375
fare       2375
ride_id    2375
dtype: int64

In [10]:
city_data_df.isnull().sum()

city            0
driver_count    0
type            0
dtype: int64

In [11]:
city_data_df.dtypes

city            object
driver_count     int64
type            object
dtype: object

In [12]:
city_data_df["type"].unique()

array(['Urban', 'Suburban', 'Rural'], dtype=object)

In [13]:
sum(city_data_df["type"]=="Urban")

66

In [14]:
ride_data_df.dtypes

city        object
date        object
fare       float64
ride_id      int64
dtype: object

In [19]:
pyber_data_df = pd.merge(ride_data_df,city_data_df, how='left',on=["city", "city"])

In [20]:
pyber_data_df.head(2)

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,2019-01-14 10:14:22,13.83,5739410935873,5,Urban
1,South Michelleport,2019-03-04 18:24:09,30.24,2343912425577,72,Urban